
-- 窗口ID
WIND_ID_LOL_LOGIN = 1    -- /*英雄联盟登陆窗口*/
WIND_ID_LOL_CLIENT = 2   -- /*英雄联盟大厅窗口*/
WIND_ID_HB_LOGIN = 3   -- /*炉石传说登陆窗口*/
WIND_ID_HB_CLIENT = 4    -- /*炉石传说客户端窗口*/
WIND_ID_HB_BATTLENET = 5    -- /*炉石传说战网窗口*/
WIND_ID_HB_FRIENDS = 6    -- /*炉石传说好友窗口*/


GAME_LOL = 1    -- /*英雄联盟*/
GAME_HB = 2		-- 炉石传说


WJAM_RES_OK = 0		-- /* 执行成功 */

WJAM_RES_TIMEOUT = 100		-- /* 操作超时 */
WJAM_RES_TIMEOUT_LOL_LOGIN_STARTUP = 101	-- /* 启动登陆窗口超时 */
WJAM_RES_TIMEOUT_LOL_LOGIN_LOADING = 102	-- /* 登陆窗口加载超时 */
WJAM_RES_TIMEOUT_LOL_SELECT_SERVER = 103	-- /* 选择服务器超时 */
WJAM_RES_TIMEOUT_LOL_HALL_STARTUP = 104		-- /* 启动游戏大厅窗口失败 */
WJAM_RES_TIMEOUT_LOL_HALL_LOADING = 105		-- /* 启动游戏大厅窗口失败 */
WJAM_RES_TIMEOUT_LOL_HALL_PLAY_DISABLE = 105	-- /*  */

WJAM_RES_UNKNOWN_GAME = 2		-- /* 未知的游戏 */
WJAM_RES_WINDOW_NOT_EXIST = 3		-- /* 窗口不存在 */
WJAM_RES_CLOSE_PROCESS_FAILED = 4		-- /* 关闭游戏失败 */


WJAM_RES_LUA_NOT_INIT = 501	-- /* LUA 未初始化 */
WJAM_RES_LUA_PARAM_ERROR = 502	-- /* LUA参数错误 */
WJAM_RES_LUA_EXCE_ERROR = 503	-- /* LUA 执行异常 */

WJAM_RES_LOL_EXIST_IN_GAME = 1001	-- /* LOL 正在游戏中 */
WJAM_RES_LOL_EXIST_IN_SERVER = 1002	-- /* LOL 已经登陆选择服务区,但未进入游戏 */
WJAM_RES_LOL_SELECT_SERVER_FAILED = 1003	-- /* LOL 选择服务器失败 */
WJAM_RES_LOL_ROOM_EXIST = 1004	        -- /* 房间已经存在 */
WJAM_RES_LOL_LOGIN_FROM_DISCONNECTION = 1005	-- /* 游戏处于断线重连状态 */

WJAM_RES_LOL_ROOM_NOT_EXIST = 1006	        -- /* 加入游戏时，房间不存在 */



VK_RETURN = 13

WINDOW_CLASS_TXGuiFoundation = "TXGuiFoundation" -- 直播窗口

WINDOW_TITLE_LOL_LOGIN = "英雄联盟登录程序"
WINDOW_TITLE_LOL_CLIENT = "PVP.net 客户端"
WINDOW_TITLE_LOL_GAME = "League of Legends (TM) Client"
WINDOW_TITLE_HB_LOGIN = "战网登录"
WINDOW_TITLE_HB_CLIENT = "PVP.net 客户端"
WINDOW_TITLE_HS_BATTLENET = "战网"
WINDOW_TITLE_HS_GAME = "炉石传说"
WINDOW_TITLE_HB_FRIENDS = "好友"


INJECTED_DLLNAME_LOL = "ExtendLOL.dll"
EXTEND_DLL_HS = "ExtendHS.dll"



-- 服务器选择位置
server =
{
    { '艾欧尼亚', { 100, 220 } },   -- 1
	{ '比尔吉沃特', { 100, 530 } },  --2
    { '祖安', { 250, 220 } },	    -- 3
	{ '诺克萨斯', { 400, 220 } },   -- 4
	{ '班德尔城', { 550, 220 } },   -- 5
	{ '德玛西亚', { 250, 530 } },   -- 6
    { '皮尔特沃夫', { 100, 275 } }, -- 7
	{ '战争学院', { 250, 275 } },	-- 8
	{ '弗雷尔卓德', { 400, 530 } }, -- 9
    { '巨神峰', { 400, 275 } },	   -- 10
    { '雷瑟守备', { 550, 275 } },  -- 11
	{ '无畏先锋', { 550, 530 } },  -- 12
	{ '裁决之地', { 250, 330 } },  -- 13
	{ '黑色玫瑰', { 400, 330 } },  -- 14
	{ '暗影岛', { 550, 330 } },	   -- 15
	{ '恕瑞玛', { 100, 585 } },    -- 16
	{ '钢铁烈阳', { 100, 330 } },  -- 17
	{ '水晶之痕', { 250, 385 } },  -- 18
	{ '均衡教派', { 100, 385 } },  -- 19
	{ '扭曲丛林', { 250, 585 } },  -- 20
	{ '教育网专区', { 100, 680 } },-- 21
	{ '影流', { 400, 385 } },      -- 22
	{ '守望之海', { 550, 385 } },  -- 23
	{ '征服之海', { 100, 440 } },  -- 24
    { '卡拉曼达', { 250, 440 } },  -- 25
	{ '巨龙之巢', { 400, 585 } },  -- 26
    { '皮城警备', { 400, 440 } },  -- 27	
}

-- 账号位置
accountpos = { 1184, 246 }
-- 密码位置
passwordpos = { 1167, 306 }
-- 登录按钮位置
loginbutton = { 1154, 445 }
-- 服务器选择位置
servershow = { 1088, 651 }
-- 进入服务器位置
enterserver = { 913, 652 }
-- 进入游戏按钮
playbutton = { 637, 37 }
-- 自定义游戏
customgame = { 324, 230 }
-- 创建游戏
creategame = { 925, 690 }
-- 地图选择
choosemap = { 1, 1 }

-- 队伍人数选择
playerNumPos = {{ 288, 570 }, { 288, 596 },{ 288, 618 },{ 288, 640 },{ 288, 668 },{ 288, 692 } }


-- 游戏类型选择
-- 自选、征召、随机
gameTypePos = {{ 455, 605 },{455, 632 },{ 455, 653 },{ 455, 683 }}

 -- 地图选择
mapTypePos = {{ 200, 230 },{530, 230 },{ 200, 420 }}

-- 房间名称
roomnamepos = { 399, 644 }
-- 房间密码
roompasswordpos = { 378, 683 }

-- 创建房间按钮
createRoomBtnPos = { 626, 723 }
-- 开始游戏
startgame = { 1, 1 }
-- 加入游戏
joingame = { 744, 688 }
-- 显示密码
showpasswd = { 322, 734 }
-- 房间搜索
searchroom = { 870, 105 }
-- 房间位置
roompos = { 224, 183 }
-- 加入阵营
joincamp = { 1, 1 }
-- 返回大厅
hallpos = { 85, 40 }
-- 确认密码
confirmpasswd = { 564, 492 }

roomrepaitok = { 640, 436 }

pos_start = { 1140, 735 }

-- pic_start_btn = {{ 1178, 245 }, { 1242, 244 }, { 1089, 304 }, { 1091, 445 }, { 1145, 151 }}
-- start_btn_value = {{ 13, 21, 28 }, { 161, 156, 142 }, { 13, 21, 28 }, { 171, 18, 2 }, { 230, 183, 72 }}


-- 登陆页面关键像素
pixel_login = { { 1178, 245, 13, 21, 28 }, { 1242, 244, 161, 156, 142 }, { 1089, 304, 13, 21, 28 }, { 1091, 445, 171, 18, 2 }, { 1145, 151, 230, 183, 72 } }

-- 登陆页面关键像素位置
pixel_login_page2 = { { 690, 660, 17, 45, 51 }, { 800, 660, 18, 45, 51 }, { 840, 660, 168, 13, 3 }, { 980, 660, 182, 19, 0 }, { 1140, 660, 16, 43, 51 } }

-- 服务器页面关键像素位置
pixel_server = { { 720, 656, 183, 172, 135 }, { 772, 652, 194, 196, 170 }, { 879, 652, 251, 228, 177 }, { 980, 653, 191, 31, 0 }, { 1076, 653, 103, 102, 71 } }

-- 服务器列表页面关键像素位置
--pixel_serverlist = { { 160, 224, 19, 51, 59 }, { 160, 279, 26, 58, 66 }, { 160, 335, 18, 50, 58 }, { 160, 387, 22, 49, 59 }, { 160, 444, 18, 50, 58 } }
pixel_serverlist = { { 840,651,166,18,0 }, { 860,666,171,12,3 }, { 988,643,198,50,0 }, { 991,662,190,31,0 }, { 917,670,177,9,4 } }
-- 服务器列表页面关键像素值

-- 服务器列表页面选中时的关键像素值
-- serverlist1_value = { { 7, 62, 167 }, { 7, 62, 167 }, { 7, 62, 167 }, { 7, 62, 167 }, { 7, 62, 167 } }

-- 大厅页面关键像素位置
pixel_hall = { { 580, 50, 150, 19, 14 }, { 700, 50, 124, 25, 29 }, { 850, 50, 153, 66, 0 }, { 1055, 50, 10, 41, 50 }, { 1207, 50, 24, 24, 24 } }

-- 房间页面关键像素位置
pixel_room = { { 718, 53, 206, 165, 102 }, { 718, 55, 106, 85, 57 }, { 722, 51, 94, 91, 70 }, { 715, 57, 176, 141, 96 }, { 721, 57, 150, 105, 51 } }

-- play页面关键像素位置
pixel_play = { { 315, 728, 31, 69, 113 }, { 706, 779, 174, 136, 85 }, { 790, 779, 12, 29, 34 }, { 810, 730, 162, 35, 0 }, { 1020, 730, 162, 35, 0 } }

---- play页面关键像素位置
-- pic_play = { { 570, 20 }, { 640, 20 }, { 710, 20 }, { 600, 60 }, { 680, 60 } }
---- play页面关键像素值
-- play_value = { { 197, 77, 22 }, { 193, 75, 23 }, { 182, 65, 24 }, { 134, 14, 17 }, { 105, 10, 15 } }

-- 显示密码页面关键像素位置
pixel_showpasswd = { { 317, 735, 0, 13, 24 }, { 318, 737, 0, 13, 24 }, { 320, 736, 0, 13, 24 }, { 321, 734, 0, 13, 24 }, { 324, 731, 1, 15, 27 } }
-- 显示密码页面关键像素值
-- showpasswd_value = { {  }, { }, {  }, {  }, { } }

-- 房间列表页面关键像素位置
pixel_roomlist = { { 830, 105, 255, 255, 255 }, { 840, 105, 255, 255, 255 }, { 850, 105, 255, 255, 255 }, { 860, 105, 255, 255, 255 }, { 870, 105, 255, 255, 255 } }

-- 创建房间名称重复关键像素位置
pixel_room_repait = { { 540, 360,31, 37, 61 }, { 620, 360,31, 37, 61 }, { 680, 360,31, 37, 61 }, { 740, 360,31, 37, 61 }, { 820, 360,31, 37, 61} }

pixel_room_exist = {{24,182,122,122,122},{24,186,122,122,122},{27,184,122,122,122},{29,182,122,122,122},{29,186,122,122,122}}

pixel_player_in = {{640,160,13,47,86},{680,160,13,47,86},{750,160,14,48,88},{780,160,14,48,88},{770,148,45,90,146}}

pixel_reconn = {{570,460, 180,71,1}, {570,448,214, 127,25},{640,464,169,61,1}, {710,450,209,120,25}, {710, 160, 181,75,1}}


-- 炉石账号位置
hbaccountpos = { 555, 164 }
-- 炉石密码位置
hbpasswordpos = { 555, 215 }
-- 炉石登录按钮位置
hbloginbutton = { 541, 300 }
-- 进入炉石按钮位置
hbenterbutton = { 230, 680 }
-- 炉石好友按钮位置
hbfriendsbutton = { 1125, 54 }
-- 炉石好友查找位置
hbfindfriends = { 266, 100 }

-- 红方加入按钮位置
pic_redjoin = { { 200, 155 }, { 200, 225 }, { 200, 295 }, { 200, 365 }, { 200, 435 } }
-- 蓝方加入按钮位置
pic_bulejoin = { { 680, 155 }, { 680, 225 }, { 680, 295 }, { 680, 365 }, { 680, 435 } }
-- 房间列表页面关键像素值
redjoin_value = { 29, 64, 106 }

-- 战网页面关键像素位置
pic_battlenet = { { 200, 680 }, { 220, 680 }, { 230, 680 }, { 240, 680 }, { 250, 680 } }
-- 战网页面关键像素值
battlenet_value = { { 9, 138, 199 }, { 9, 138, 199 }, { 230, 243, 249 }, { 82, 208, 249 }, { 230, 208, 216 } }