#pragma once


////////////////////////////////////////////////////////////////////////////////////////////
#define  OFFSET_游戏结果     0x17A19BC             
//值         意义
//0          初始化
//1          胜利
//2          失败
//3          放弃

#define  OFFSET_游戏编号 [0x17A6A4C] + 0x70	

#define  OFFSET_推塔  0x17A15C0
#define  OFFSET_大龙  0x17A60D8
#define  OFFSET_小龙  0x17A60E8


#define  OFFSET_PLAYER 0x017A7C30
#define  OFFSET_玩家英雄 0x00003540 + [OFFSET_PLAYER]        //这个英雄的英文名称
#define  OFFSET_角色名称 0x00000020 + [OFFSET_PLAYER]        //玩家自己的名称
#define  OFFSET_召唤师技能 [[[OFFSET_PLAYER] + 0x2588 + 0x518 + N * 4 + 0x10]+ 0xEC] + 0x18    

//当N == 0\1的时候就是玩家选择的召唤师技能名
//
//召唤师技能的字符串值 :
//SummonerExhaust 虚弱
//SummonerSmite   惩戒
//SummonerDot     引然
//SummonerFlash   闪现
//SummonerBarrier 屏障
//SummonerBoost   净化
//SummonerHeal    治疗术
//SummonerHaste   幽灵疾步
//其它数值        传送


#define  OFFSET_信息板                     0x017A6B00  
#define  OFFSET_1                          0x0000002C + [OFFSET_信息板]
#define  OFFSET_金币值                     0x00000044 + [OFFSET_1]
#define  OFFSET_2                          0x00000020 + [OFFSET_信息板]
#define  OFFSET_单位战斗属性基础偏移       0x00000014 + [OFFSET_2]
#define  OFFSET_法术强度                   0x00000000 + [OFFSET_单位战斗属性基础偏移]	//FLOAT
#define  OFFSET_护甲	                   0x00000008 + [OFFSET_单位战斗属性基础偏移]	//FLOAT
#define  OFFSET_攻击力	                   0x00000010 + [OFFSET_单位战斗属性基础偏移]	//FLOAT
#define  OFFSET_攻击速度                   0x00000018 + [OFFSET_单位战斗属性基础偏移]	//FLOAT
#define  OFFSET_魔法抗性                   0x00000020 + [OFFSET_单位战斗属性基础偏移]	//FLOAT
#define  OFFSET_移动速度                   0x00000028 + [OFFSET_单位战斗属性基础偏移]	//FLOAT
#define  OFFSET_暴击几率                   0x00000030 + [OFFSET_单位战斗属性基础偏移]	//FLOAT
#define  OFFSET_法术吸取                   0x00000038 + [OFFSET_单位战斗属性基础偏移]	//FLOAT
#define  OFFSET_生命偷取                   0x00000040 + [OFFSET_单位战斗属性基础偏移]	//FLOAT
#define  OFFSET_冷却缩减                   0x00000048 + [OFFSET_单位战斗属性基础偏移]	//FLOAT
#define  OFFSET_法术穿透                   0x00000050 + [OFFSET_单位战斗属性基础偏移]	//FLOAT
#define  OFFSET_护甲穿透                   0x00000058 + [OFFSET_单位战斗属性基础偏移]	//FLOAT
#define  OFFSET_韧性                       0x00000060 + [OFFSET_单位战斗属性基础偏移]	//FLOAT
#define  OFFSET_攻击距离                   0x00000068 + [OFFSET_单位战斗属性基础偏移]	//FLOAT
#define  OFFSET_生命恢复                   0x00000070 + [OFFSET_单位战斗属性基础偏移]	//FLOAT
#define  OFFSET_施法资源恢复               0x00000078 + [OFFSET_单位战斗属性基础偏移]	//FLOAT


#define  OFFSET_3          0x00000018 +  [OFFSET_信息板]
#define  OFFSET_3_1        0x00000000 +  [OFFSET_3]
#define  OFFSET_3_2        0x00000004 +  [OFFSET_3]
#define  OFFSET_当前血值   0x00000058 +  [OFFSET_3_1]                   //FLOAT
#define  OFFSET_最大血值   0x0000005C +  [OFFSET_3_1]                   //FLOAT
#define  OFFSET_当前魔法值 0x00000054 +  [OFFSET_3_2]                   //FLOAT
#define  OFFSET_最大魔法值 0x00000058 +  [OFFSET_3_2]                   //FLOAT

#define  OFFSET_4          0x0000001C +  [OFFSET_信息板]
#define  OFFSET_等级       0x00000044 +  [OFFSET_4]                     //int

#define  OFFSET_5            0x00000010 + [OFFSET_信息板]
#define  OFFSET_包裹数组     0x00000004 + [OFFSET_5]                     //LOL一共有8个格子，从0开始编号
#define  OFFSET_第N个格子    0x00000004*N + OFFSET_包裹数组              //格子对象地址      
#define  OFFSET_物品数量     0x00000044 + [OFFSET_第N个格子]             //第N个格子物品的购买数量，从0开始编号，如果数量为0，说明只能买1件
#define  OFFSET_物品对象     0x00000048 + [OFFSET_第N个格子]             //第N个格子的物品对象指针，从0开始编号
#define  OFFSET_物品ID       0x00000070 + [OFFSET_物品对象]              //第N个格子的物品ID，对应关系如下表所示
#define  OFFSET_物品英文名称指针 0x00000078 + [OFFSET_物品对象]          //第N个格子的物品英文名称指针，从0开始编号  

#define  OFFSET_6          0x00000040 +  [OFFSET_信息板]
#define  OFFSET_6_1        0x00000004 +  [OFFSET_6]
#define  OFFSET_6_1_1      0x00000000 +  [OFFSET_6_1]
#define  OFFSET_6_1_1_1    0x00000000 +  [OFFSET_6_1_1]
#define  OFFSET_6_1_1_2	   0x00000004 +  [OFFSET_6_1_1]
#define  OFFSET_击杀       0x00000024 +  [OFFSET_6_1_1_1]
#define  OFFSET_死亡       0x00000028 +  [OFFSET_6_1_1_1]	//[基址]+40]+4+0+0+28
#define  OFFSET_助攻       0x0000002C +  [OFFSET_6_1_1_1]		         
#define  OFFSET_补刀数	   0x00000024 +  [OFFSET_6_1_1_2]

//物品名称		物品ID		金钱
//监视图腾		3340		0
//扫描透镜		3341		0
//远见改造		3363		0
//神谕改造		3364		0
//生命药水		2003		50
//真视守卫		2043		75
//仙女护符		1004		125
//治疗宝珠		1006		150
//复用型药水		2031		150
//速度之靴		1001		300
//布甲			1029		300
//短剑			1042		300
//蓝水晶			1027		350
//长剑			1036		350
//猎人的护身符		1039		350
//猎人的宽刃剑		1041		350
//上古钱币		3301		350
//圣物之盾		3302		350
//窃法之刃		3303		350
//红水晶			1028		400
//格斗手套		1051		400
//多兰之戒		1056		400
//黑暗封印		1082		400
//猎人药水		2032		400
//增幅典书籍		1052		435
//抗魔斗篷		1033		450
//多兰之盾		1054		450
//多兰之刃		1055		450
//萃取			1083		450
//腐败药水		2033		500
//钢铁合剂		2138		500
//巫术合剂		2139		500
//愤怒合剂		2140		500
//禁忌雕像		3114		550
//晶体护腕		3801		650
//负极斗篷		1057		720
//基舍艾斯碎片		2015		750
//女神之泪		3070		750
//灵巧斗篷		1018		800
//锁子甲			1031		800
//洞察之石		2049		800
//轻灵之靴		3009		800
//燃烧宝石		3067		800
//恶魔法典		3108		800
//疾行之靴		3117		800
//死刑宣告		3123		800
//明朗之靴		3158		800
//爆裂魔杖		1026		850
//游牧民印章		3096		850
//巨神峰之擎		3097		850
//冰霜之牙		3098		850
//以太精魂		3113		850
//十字镐			1037		875
//吸血鬼节仗		1053		900
//巨人腰带		1011		1000
//反曲之弓		1043		1000
//冰川护甲		3024		1000
//和谐圣杯		3028		1000
//巨人杀手		3034		1000
//追猎者的刀锋		3706		1000
//追踪者的匕首		3711		1000
//游击者的军刀		3715		1000
//耀光			3057		1050
//狂战士胫甲		3006		1100
//法师之靴		3020		1100
//忍者足具		3047		1100
//守望者铠甲		3082		1100
//水银之靴		3111		1100
//考尔菲德的战锤		3133		1100
//锯齿短匕		3134		1100
//幽魂斗篷		3211		1100
//斑比的熔渣		3751		1100
//猛禽斗篷		2053		1200
//催化神石		3010		1200
//紫雨林之拳		3052		1200
//提亚马特		3077		1200
//蜂刺			3101		1200
//海克斯科技左轮枪	3145		1200
//探索者的护臂		3191		1200
//无用大棒		1058		1250
//净蚀			3044		1250
//暴风大剑		1038		1300
//最后的轻语		3035		1300
//狂热			3086		1300
//水银饰带		3140		1300
//海克斯饮魔刀		3155		1300
//梅贾的窃魂卷		3041		1400
//军团圣盾		3105		1500
//幽魂面具		3136		1600
//比尔吉沃特弯刀		3144		1650
//洞察红宝石		2045		1800
//守望之眼		2301		2200
//绿洲之眼		2302		2200
//季分之眼		2303		2200
//飞升护符		3069		2200
//冰霜女皇的旨令		3092		2200
//山岳之容		3401		2200
//炽热香炉		3504		2200
//远古意志		3152		2300
//米凯尔的坩埚		3222		2300
//深渊权杖		3001		2350
//基克的先驱		3050		2350
//荆棘之甲		3075		2350
//魔宗			3004		2400
//钢铁烈阳之匣		3190		2500
//莫雷洛秘典		3165		2550
//卢安娜的飓风		3085		2600
//斯塔提克电刃		3087		2600
//疾射火炮		3094		2600
//正义荣耀		3800		2600
//干扰水晶		3056		2650
//虚空之杖		3135		2650
//冰脉护手		3025		2700
//凡性的提醒		3033		2700
//多米尼克领主的致意	3036		2700
//斯特拉克的挑战护手	3053		2700
//日炎斗篷		3068		2700
//兹若特传送门		3512		2700
//幻影之舞		3046		2800
//振奋盔甲		3065		2800
//智慧末刃		3091		2800
//冰霜之心		3110		2800
//鬼索的狂暴之刃		3124		2800
//雅典娜的邪恶圣杯	3174		2800
//亡者的板甲		3742		2800
//狂徒铠甲		3083		2850
//守护天使		3026		2900
//号令之旗		3060		2900
//女妖面纱		3102		2900
//时光之仗		3027		3000
//纳什之牙		3115		3000
//兰顿之兆		3143		3000
//大天使之仗		3003		3100
//冰霜之锤		3022		3100
//巫妖之祸		3100		3200
//瑞莱的冰晶节仗		3116		3200
//幽梦之灵		3142		3200
//兰德里的折磨		3151		3200
//卢登的回声		3285		3200
//玛莫提乌斯之噬		3156		3250
//海克斯科技枪刃		3146		3400
//破败王者之刃		3153		3400
//黑色切割者		3071		3400
//贪欲九头蛇		3074		3500
//中娅沙漏		3157		3500
//巨型九头蛇		3748		3500
//死亡之舞		3812		3500
//无尽之刃		3031		3600
//夺萃之镰		3508		3600
//饮血剑			3072		3700
//水银弯刀		3139		3700
//三相之力		3078		3800
//灭世者的死亡之帽	3089		3800